{
    "terminal_size": {
        "width": 80,
        "height": 24
    },
    "log_settings": {
        "log_filename": "COMMonitor",
        "log_level": "INFO",
        "log_format": "%(asctime)s - %(levelname)s - %(message)s",
        "log_date_format": "%Y-%m-%d %H:%M:%S"
    },
    "error_codes": {
        "1": "Incorrect function. This could happen if a function is called on a COM port that does not support it.",
        "2": "File Not Found (The specified COM port could not be found or is disabled.)",
        "5": "Access Denied (The COM port is in use by another application.)",
        "6": "The handle is invalid. This might happen if there’s a problem with how the port was opened or managed.",
        "10": "The environment is incorrect. This might indicate an issue with the configuration of the COM port.",
        "20": "The system cannot find the device specified. Similar to ERROR_FILE_NOT_FOUND, it might indicate that the COM port is missing.",
        "21": "The device is not ready. This might occur if the COM port device is not ready to receive data.",
        "22": "The device does not recognize the command given to it. This could indicate that the command or data sent to the COM port is not valid.",
        "24": "The length of the data provided to a system call is invalid.",
        "31": "A device attached to the system is not functioning. This could indicate hardware issues with the port.",
        "87": "The parameter is incorrect. This might occur if the port is being accessed with incorrect settings or configurations.",
        "110": "The system cannot open the device or file specified.",
        "121": "The semaphore timeout period has expired. This might occur if the device connected to the port is not responding.",
        "122": "The data area passed to a system call is too small.",
        "234": "More data is available. This might occur if a buffer is too small to hold the data being received.",
        "995": "The I/O operation has been aborted due to thread exit or application request.",
        "998": "Invalid access to memory location. This might happen if the memory associated with the COM port is not accessible.",
        "1117": "The request could not be performed because of an I/O device error. This indicates a general problem with the hardware.",
        "1167": "The device is not connected. This usually occurs when the device was physically disconnected or powered off.",
        "1460": "This operation returned because the timeout period expired."
    }
}
